PINGSET  DFHMSD TYPE=&SYSPARM,MODE=INOUT,LANG=COBOL,STORAGE=AUTO,      X
               TIOAPFX=YES
PINGMAP  DFHMDI SIZE=(24,80)
         DFHMDF POS=(1,1),LENGTH=12,ATTRB=(PROT,BRT),                  X
               INITIAL='PING SCREEN'
PINGVAL  DFHMDF POS=(3,1),LENGTH=8,ATTRB=(UNPROT,IC)
         DFHMSD TYPE=FINAL
         END
