CUSTMAP  DFHMSD TYPE=&SYSPARM,MODE=INOUT,LANG=COBOL,STORAGE=AUTO,      X
               TIOAPFX=YES,CTRL=(FREEKB,FRSET)
CUSTM1   DFHMDI SIZE=(24,80),LINE=1,COLUMN=1
         DFHMDF POS=(1,25),LENGTH=30,ATTRB=(PROT,BRT),                 X
               INITIAL='CUSTOMER ENQUIRY'
CUSTID   DFHMDF POS=(5,20),LENGTH=10,ATTRB=(UNPROT,IC),PICIN='X(10)'
         DFHMSD TYPE=FINAL
         END
