BRKNSET  DFHMSD TYPE=&SYSPARM,MODE=INOUT,LANG=COBOL,STORAGE=AUTO,
               TIOAPFX=YES
BRKNMAP  DFHMDI SIZE=(24,80)
         DFHMDF POS=(1,1),LENGTH=10,ATTRB=(PROT,BRT)
         DFHMSD TYPE=FINAL
         END
