CUSTSET  DFHMSD TYPE=&SYSPARM,MODE=INOUT,LANG=COBOL,STORAGE=AUTO,      X
               TIOAPFX=YES
CUSTMAP  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1
         DFHMDF POS=(1,26),LENGTH=27,ATTRB=(PROT,BRT),                 X
               INITIAL='CUSTOMER ENQ
