         DBD   NAME=CUSTDB,ACCESS=(HDAM,OSAM)
         DATASET DD1=CUSTPRIM,DEVICE=3390,SIZE=8192
         SEGM  NAME=CUSTOMER,BYTES=200,PARENT=0
         FIELD NAME=(CUSTID,SEQ,U),BYTES=10,START=1,TYPE=C
         FIELD NAME=CUSTNAME,BYTES=40,START=11,TY
