 /* Included member: the address block the order record clones twice. */
 DCL 1 ADDRESS_BLOCK,
       2 ADDR_NAME     CHAR(40),
       2 ADDR_LINE1    CHAR(35),
       2 ADDR_LINE2    CHAR(35),
       2 ADDR_CITY     CHAR(25),
       2 ADDR_REGION   CHAR(15),
       2 ADDR_POSTCODE CHAR(10),
       2 ADDR_COUNTRY  CHAR(3);
