         DBD   NAME=BEACONDB,ACCESS=(HDAM,OSAM)
         DATASET DD1=BEACON,DEVICE=3390,SIZE=4096
         SEGM  NAME=BEACON,BYTES=32,PARENT=0
         FIELD NAME=(BCNID,SEQ,U),BYTES=16,START=1,TYPE=C
         FIELD NAME=BCNTIME,BYTES=8,START=17,TYPE=P
         DBDGEN
         FINISH
         END
