*********************************************************************
* Customer database: HDAM root with two dependent segment types.    *
*********************************************************************
         DBD   NAME=CUSTDB,ACCESS=(HDAM,OSAM),                         X
               RMNAME=(DFSHDC40,10,500,824)
         DATASET DD1=CUSTPRIM,DEVICE=3390,SIZE=8192,SCAN=3
*
         SEGM  NAME=CUSTOMER,BYTES=200,PARENT=0
         FIELD NAME=(CUSTID,SEQ,U),BYTES=10,START=1,TYPE=C
         FIELD NAME=CUSTNAME,BYTES=40,START=11,TYPE=C
         FIELD NAME=CUSTSTAT,BYTES=1,START=51,TYPE=C
         FIELD NAME=CUSTOPEN,BYTES=8,START=52,TYPE=C
         FIELD NAME=CUSTBAL,BYTES=8,START=60,TYPE=P
         FIELD NAME=CUSTCCY,BYTES=3,START=68,TYPE=C
*
         SEGM  NAME=ADDRESS,BYTES=120,PARENT=CUSTOMER
         FIELD NAME=(ADDRTYPE,SEQ,U),BYTES=2,START=1,TYPE=C
         FIELD NAME=ADDRLIN1,BYTES=35,START=3,TYPE=C
         FIELD NAME=ADDRLIN2,BYTES=35,START=38,TYPE=C
         FIELD NAME=ADDRCITY,BYTES=25,START=73,TYPE=C
         FIELD NAME=ADDRPOST,BYTES=10,START=98,TYPE=C
         FIELD NAME=ADDRCTRY,BYTES=3,START=108,TYPE=C
*
         SEGM  NAME=ORDER,BYTES=160,PARENT=CUSTOMER
         FIELD NAME=(ORDERID,SEQ,U),BYTES=10,START=1,TYPE=C
         FIELD NAME=ORDDATE,BYTES=8,START=11,TYPE=C
         FIELD NAME=ORDSTAT,BYTES=1,START=19,TYPE=C
         FIELD NAME=ORDTOTAL,BYTES=8,START=20,TYPE=P
         FIELD NAME=ORDCCY,BYTES=3,START=28,TYPE=C
*
         DBDGEN
         FINISH
         END
